# ManyUnusedNestedFamilies Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..PerformanceFailures..::..ManyUnusedNestedFamilies Property
BuiltInFailures..::..PerformanceFailures Class See Also
---
Family contains other families loaded into it but not used. Consider purging family document from unused families and types.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ManyUnusedNestedFamilies { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ManyUnusedNestedFamilies As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ManyUnusedNestedFamilies {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..PerformanceFailures Class
Autodesk.Revit.DB Namespace